In [551]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [552]:
df = pd.read_csv("bengaluru_house_prices.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [553]:
df.shape

(13320, 9)

In [554]:
df.groupby("area_type")["area_type"].agg("count")

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [555]:
df = df.drop(["area_type","availability", "society", "balcony"], axis=1)
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [556]:
df.isna

<bound method DataFrame.isna of                        location       size total_sqft  bath   price
0      Electronic City Phase II      2 BHK       1056   2.0   39.07
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2                   Uttarahalli      3 BHK       1440   2.0   62.00
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                      Kothanur      2 BHK       1200   2.0   51.00
...                         ...        ...        ...   ...     ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00
13316             Richards Town      4 BHK       3600   5.0  400.00
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00
13319              Doddathoguru      1 BHK        550   1.0   17.00

[13320 rows x 5 columns]>

In [557]:
df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [558]:
df = df.dropna()
df.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [559]:
df["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [560]:
df["bhk"] = df["size"].str.split(" ").str[0]

C:\Users\HP\AppData\Local\Temp\ipykernel_21640\2664055229.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["bhk"] = df["size"].str.split(" ").str[0]

In [561]:
df.head()

                   location       size total_sqft  bath   price bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07   2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00   4
2               Uttarahalli      3 BHK       1440   2.0   62.00   3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00   3
4                  Kothanur      2 BHK       1200   2.0   51.00   2

In [562]:
df = df.drop("size", axis=1)
df.head()

                   location total_sqft  bath   price bhk
0  Electronic City Phase II       1056   2.0   39.07   2
1          Chikka Tirupathi       2600   5.0  120.00   4
2               Uttarahalli       1440   2.0   62.00   3
3        Lingadheeranahalli       1521   3.0   95.00   3
4                  Kothanur       1200   2.0   51.00   2

In [563]:
df["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [564]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13246 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13246 non-null  object
 1   total_sqft  13246 non-null  object
 2   bath        13246 non-null  float64
 3   price       13246 non-null  float64
 4   bhk         13246 non-null  object
dtypes: float64(2), object(3)
memory usage: 620.9+ KB

In [565]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [566]:
df[~df["total_sqft"].apply(is_float)]

                 location   total_sqft  bath    price bhk
30              Yelahanka  2100 - 2850   4.0  186.000   4
122                Hebbal  3067 - 8156   4.0  477.000   4
137    8th Phase JP Nagar  1042 - 1105   2.0   54.005   2
165              Sarjapur  1145 - 1340   2.0   43.490   2
188              KR Puram  1015 - 1540   2.0   56.800   2
...                   ...          ...   ...      ...  ..
12975          Whitefield   850 - 1060   2.0   38.190   2
12990      Talaghattapura  1804 - 2273   3.0  122.000   3
13059              Harlur  1200 - 1470   2.0   72.760   2
13265               Hoodi  1133 - 1384   2.0   59.135   2
13299          Whitefield  2830 - 2882   5.0  154.500   4

[190 rows x 5 columns]

In [567]:
def convert_sqft_to_num(x):
    token = x.split("-")
    if len(token) == 2:
        return (float(token[0]) + float(token[1]))/2
    try:
        return float(x)
    except:
        return None

In [568]:
df1 = df.copy()
df1["total_sqft"] = df["total_sqft"].apply(convert_sqft_to_num)
df1.head(10)

                   location  total_sqft  bath   price bhk
0  Electronic City Phase II      1056.0   2.0   39.07   2
1          Chikka Tirupathi      2600.0   5.0  120.00   4
2               Uttarahalli      1440.0   2.0   62.00   3
3        Lingadheeranahalli      1521.0   3.0   95.00   3
4                  Kothanur      1200.0   2.0   51.00   2
5                Whitefield      1170.0   2.0   38.00   2
6          Old Airport Road      2732.0   4.0  204.00   4
7              Rajaji Nagar      3300.0   4.0  600.00   4
8              Marathahalli      1310.0   3.0   63.25   3
9              Gandhi Bazar      1020.0   6.0  370.00   6

In [569]:
# Feature Engineering and Dimentionality reduction 

# Creating a new feature price per square feet
df1["price_per_sqft"] = df1["price"]*100000/df1["total_sqft"]

df1.head()

                   location  total_sqft  bath   price bhk  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07   2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00   4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00   3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00   3     6245.890861
4                  Kothanur      1200.0   2.0   51.00   2     4250.000000

In [570]:
df1.location  = df1.location.apply(lambda x: x.strip())

In [571]:
location_stats = df1.groupby("location")["location"].agg("count").sort_values(ascending = False)
location_stats

location
Whitefield               535
Sarjapur  Road           392
Electronic City          304
Kanakpura Road           266
Thanisandra              236
                        ...
1 Giri Nagar               1
Kanakapura Road,           1
Kanakapura main  Road      1
Karnataka Shabarimala      1
whitefiled                 1
Name: location, Length: 1293, dtype: int64

In [572]:
len(location_stats[location_stats<=10])

1052

In [573]:
location_stats_less_than_10 = location_stats[location_stats<=10]

In [574]:
df1["location"] = df1.location.apply(lambda x: "other" if x in location_stats_less_than_10 else x)

df1.head(100)

                      location  total_sqft  bath   price bhk  price_per_sqft
0     Electronic City Phase II      1056.0   2.0   39.07   2     3699.810606
1             Chikka Tirupathi      2600.0   5.0  120.00   4     4615.384615
2                  Uttarahalli      1440.0   2.0   62.00   3     4305.555556
3           Lingadheeranahalli      1521.0   3.0   95.00   3     6245.890861
4                     Kothanur      1200.0   2.0   51.00   2     4250.000000
..                         ...         ...   ...     ...  ..             ...
97   Sarjapura - Attibele Road      1330.0   2.0   48.00   3     3609.022556
98                       other      1200.0   2.0   65.00   2     5416.666667
99                       other      1200.0   3.0   90.00   3     7500.000000
100               Yeshwanthpur      2502.0   3.0  138.00   3     5515.587530
101                 Chandapura       650.0   1.0   17.00   2     2615.384615

[100 rows x 6 columns]

In [575]:
df1["bhk"] = pd.to_numeric(df1["bhk"].str.split(" ").str[0], errors="coerce")

In [576]:
df1 = df1[(df1["total_sqft"]/df1["bhk"] > 300)]
df1.head()

                   location  total_sqft  bath   price  bhk  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                  Kothanur      1200.0   2.0   51.00    2     4250.000000

In [577]:
df1.shape

(12274, 6)

In [578]:
df1["price_per_sqft"].describe()

count     12274.000000
mean       6211.880230
std        4053.214807
min         267.829813
25%        4200.000000
50%        5263.157895
75%        6825.474875
max      176470.588235
Name: price_per_sqft, dtype: float64

In [579]:
def remove_pps_outliers(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby("location"):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft > (m-st)) & (subdf.price_per_sqft <=(m+st))]
        df_out = pd.concat([df_out, reduced_df], ignore_index=True)
    return df_out

df2 = remove_pps_outliers(df1)
df2.shape

(10016, 6)

In [580]:
def remove_bhk_outliers(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby("location"):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby("bhk"):
            bhk_stats[bhk] = {
                "mean": np.mean(bhk_df.price_per_sqft),
                "std": np.std(bhk_df.price_per_sqft),
                "count": bhk_df.shape[0]
            }

        for bhk, bhk_df in location_df.groupby("bhk"):
            stats = bhk_stats.get(bhk-1)
            if stats and stats["count"] > 5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft < (stats["mean"])].index.values)
    return df.drop(exclude_indices, axis="index")

df3 = remove_bhk_outliers(df2)
df3.head()

              location  total_sqft  bath  price  bhk  price_per_sqft
0  1st Block Jayanagar      2850.0   4.0  428.0    4    15017.543860
1  1st Block Jayanagar      1630.0   3.0  194.0    3    11901.840491
2  1st Block Jayanagar      1875.0   2.0  235.0    3    12533.333333
3  1st Block Jayanagar      1200.0   2.0  130.0    3    10833.333333
4  1st Block Jayanagar      1235.0   2.0  148.0    2    11983.805668

In [581]:
df3.shape

(7164, 6)

In [582]:
df3 = df3[df3.bath < df3.bath+2]
df3.shape

(7164, 6)

In [583]:
df3 = df3[df3.bath < df3.bhk+2]
df3.shape

(7088, 6)

In [584]:
dummies = pd.get_dummies(df3.location)

In [585]:
df3 = pd.concat([df3,dummies], axis=1)
df3.head()

,location,total_sqft,bath,price,bhk,price_per_sqft,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,...,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur,other
0,1st Block Jayanagar,2850.0,4.0,428.0,4,15017.543860,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1st Block Jayanagar,1630.0,3.0,194.0,3,11901.840491,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1st Block Jayanagar,1875.0,2.0,235.0,3,12533.333333,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1st Block Jayanagar,1200.0,2.0,130.0,3,10833.333333,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1st Block Jayanagar,1235.0,2.0,148.0,2,11983.805668,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [586]:
df3 = df3.drop("location", axis=1)
df3.head()

,total_sqft,bath,price,bhk,price_per_sqft,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,...,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur,other
0,2850.0,4.0,428.0,4,15017.543860,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1630.0,3.0,194.0,3,11901.840491,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1875.0,2.0,235.0,3,12533.333333,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1200.0,2.0,130.0,3,10833.333333,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1235.0,2.0,148.0,2,11983.805668,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [497]:
df3.shape

(7088, 247)

In [498]:
y = df3.price
y.head()

0    428.0
1    194.0
2    235.0
3    130.0
4    148.0
Name: price, dtype: float64

In [587]:
X = df3.drop(["price","price_per_sqft"], axis=1)

In [588]:
from sklearn.model_selection import train_test_split

X_train , X_test, y_train, y_test = train_test_split(X,y, test_size=0.2, random_state = 10)

In [589]:
from sklearn.linear_model import LinearRegression
lr_clf = LinearRegression()
lr_clf.fit(X_train, y_train)
lr_clf.score(X_test,y_test)

0.8751662958205015

In [590]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score

cv = ShuffleSplit(n_splits=5, test_size=0.2, random_state=0)
cross_val_score(LinearRegression(), X,y,cv = cv)

array([0.85858897, 0.86413485, 0.82048765, 0.82008132, 0.89136565])

In [592]:
X.columns

Index(['total_sqft', 'bath', 'bhk', '1st Block Jayanagar',
       '1st Phase JP Nagar', '2nd Phase Judicial Layout',
       '2nd Stage Nagarbhavi', '5th Block Hbr Layout', '5th Phase JP Nagar',
       '6th Phase JP Nagar',
       ...
       'Vishveshwarya Layout', 'Vishwapriya Layout', 'Vittasandra',
       'Whitefield', 'Yelachenahalli', 'Yelahanka', 'Yelahanka New Town',
       'Yelenahalli', 'Yeshwanthpur', 'other'],
      dtype='object', length=245)

In [593]:
loc_index = np.where(X.columns == "Vishveshwarya Layout")[0][0]
loc_index

235

In [594]:
def predict_price(location,sqft,bath,bhk):
    loc_index = np.where(X.columns == location)[0][0]

    x = np.zeros(len(X.columns))
    x[0] = sqft
    x[1] = bath
    x[2] = bhk
    if loc_index >=0:
        x[loc_index] = 1
        
    return lr_clf.predict([x])[0]

In [600]:
predict_price("Indira Nagar", 1000, 3, 3)

C:\Users\HP\AppData\Roaming\Python\Python311\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

185.99921321868896

In [601]:
#Export the tested model to a pickle file
import pickle
with open('banglore_home_prices_model.pickle','wb') as f:
    pickle.dump(lr_clf,f)

In [603]:
#Export location and column information to a file that will be useful later on in our prediction application
import json
columns = {
    'data_columns' : [col.lower() for col in X.columns]
}
with open("columns.json","w") as f:
    f.write(json.dumps(columns))